[
  "There are things in this world that we will never fully understand",
  "I am not a psychic medium. I am a sensitive.",
  "I taunt and provoke, but you have to understand that I do that for a reason. I want to elicit a response. Remember that my mission is to capture on film and digital recording devices evidence of the paranormal. Many times, I can't do that by being nice.",
  "When you ghost hunt, you kind of time travel: you get that residue of the past.",
  "The best part of my job is being able to travel to places to investigate powerful stories, many of which contain unsolved mysteries and deaths. To me as a documentarian and paranormal investigator, this puts the adventure in my life and meaning to my job.",
  "I want to be taken out of our material world and experience something that is in another dimension.",
  "We humans absorb a lot of negativity in this world, but dogs are pure joy.",
  "I had a full exorcism performed on me from an archbishop.",
  "Lighting is everything. It creates mood and has an emotional effect on you.",
  "Before you begin a paranormal investigation, the most important criteria you need to gather is the back history of the location.",
  "I love a good ghost story, and I love to just get in there and really just find the truth behind these stories.",
  "I've had Ferrari's; I've had Aston Martins. I've had all kinds of cars, but the thing I love about Lamborghini is that they're all-wheel drive, and when you step on the pedal, you stick to the road. You're not fishtailing all over the place.",
  "Spirits want to be heard. That's why they're not at rest.",
  "I've had some very close encounters with the other side. They chose me to do this - I was doing this all before a TV show. They chose me to communicate with them; they chose my path as a paranormal.",
  "I collect a lot of cursed objects. That's probably why I have a lot of problems.",
  "The power of our conscious mind is unimaginable.",
  "I am intrigued by the darkness.",
  "I do have a little danger in me, a little thrill-seeking part.",
  "People aren't quiet about their experiences with ghosts anymore.",
  "Something happened to me at the precise moment that my grandmother died. She was three time zones away, but that didn't matter. I believe that I felt something at that moment she passed... some bit of her mortality slipping away.",
  "Some of these spirits that are intelligent can harm you.",
  "'Ghost Hunters,' they like to go out and disprove everything and just wave a bunch of equipment around for a couple hours.",
  "If you choose to live in a home that is living on intersecting ley lines, and you're living on an Indian burial ground and having paranormal experiences that are bothersome, you're not going to get rid of them. They've taken ownership of that home and that area.",
  "I have realized that when you rescue your pet from a shelter, it is the most amazing feeling in the world how this animal changes your life by giving it a better one.",
  "People don't understand that Las Vegas is such a small community, beyond the tourists who visit here. If you've lived here for a long time, you know everybody."
]
